balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F5013.PIC
      <edc:DCRDef edc:access="--nn---n----nnnn" edc:cname="FBS" edc:default="0xffff" edc:desc="" edc:impl="0x310f" edc:name="FBS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x310f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BWRP" edc:desc="Boot Segment Program Memory Write Protect" edc:mask="0x1" edc:name="BWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WR_PROTECT_BOOT_OFF" edc:codeguardidref="PgmBootWrtProtectOff" edc:desc="Boot Segment Program Memory may be written" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WR_PROTECT_BOOT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WR_PROTECT_BOOT_ON" edc:codeguardidref="PgmBootWrtProtectOn" edc:desc="Boot Segment Program Memory is write protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WR_PROTECT_BOOT_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BSS" edc:desc="Boot Segment Program Flash Memory Code Protection" edc:mask="0x7" edc:name="BSS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="NO_BOOT_CODE" edc:codeguardidref="PgmBootNone" edc:desc="No Boot Segment" edc:when="(field &amp; 0x7) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="NO_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="STRD_SMALL_BOOT_CODE" edc:codeguardidref="PgmBootStdSm" edc:desc="Standard Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="STRD_SMALL_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="STRD_MEDIUM_BOOT_CODE" edc:codeguardidref="PgmBootStdMed" edc:desc="Standard Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="STRD_MEDIUM_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="STRD_LARGE_BOOT_CODE" edc:codeguardidref="PgmBootStdLarge" edc:desc="Standard Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x4">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="STRD_LARGE_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:desc="No Boot Segment" edc:isidehidden="true" edc:islanghidden="true" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_SMALL_BOOT_CODE" edc:codeguardidref="PgmBootHighSm" edc:desc="High Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HIGH_SMALL_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HIGH_MEDIUM_BOOT_CODE" edc:codeguardidref="PgmBootHighMed" edc:desc="High Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HIGH_MEDIUM_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HIGH_LARGE_BOOT_CODE" edc:codeguardidref="PgmBootHighLarge" edc:desc="High Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HIGH_LARGE_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="EBS" edc:desc="Boot Segment Data EEPROM Protection" edc:mask="0x1" edc:name="EBS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="NO_BOOT_EEPROM" edc:codeguardidref="EEPROMBootNone" edc:desc="No Boot EEPROM" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="NO_BOOT_EEPROM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="SMALL_BOOT_EEPROM" edc:codeguardidref="EEPROMBootSm" edc:desc="Boot EEPROM Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="SMALL_BOOT_EEPROM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="RBS" edc:desc="Boot Segment Data RAM Protection" edc:mask="0x3" edc:name="RBS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NO_BOOT_RAM" edc:codeguardidref="DataBootNone" edc:desc="No Boot RAM" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="NO_BOOT_RAM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="SMALL_BOOT_RAM" edc:codeguardidref="DataBootSm" edc:desc="Small-sized Boot RAM" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="SMALL_BOOT_RAM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="MED_BOOT_RAM" edc:codeguardidref="DataBootMed" edc:desc="Medium-sized Boot RAM" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="MED_BOOT_RAM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LARGE_BOOT_RAM" edc:codeguardidref="DataBootLarge" edc:desc="Large-sized Boot RAM" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="LARGE_BOOT_RAM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
